# GetAdditionalElements Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FailureMessage..::..GetAdditionalElements Method
FailureMessage Class See Also
---
Retrieves list of the additional reference elements for the failure.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public ICollection<ElementId> GetAdditionalElements()
```

Visual Basic
---
```text
Public Function GetAdditionalElements As ICollection(Of ElementId)
```

Visual C++
---
```text
public:
ICollection<ElementId^>^ GetAdditionalElements()
```

# ### Return Value
The additional elements.
# See Also
FailureMessage Class
Autodesk.Revit.DB Namespace